SpenceKonde/ATTinyCore/avr/boards.txt
attinyx41opti.name=ATtiny441/841 (Optiboot)
attinyx41opti.upload.tool=avrdude
attinyx41opti.upload.protocol=arduino
attinyx41opti.bootloader.tool=avrdude
attinyx41opti.bootloader.unlock_bits=0xFF
attinyx41opti.bootloader.lock_bits=0xFF
attinyx41opti.menu.bootUART.UART0=UART0 (Serial)
attinyx41opti.menu.bootUART.UART0.bootloader.postfix=
attinyx41opti.menu.bootUART.UART1=UART1 (Serial1)
attinyx41opti.menu.bootUART.UART1.bootloader.postfix=_ser1
attinyx41opti.menu.chip.841=ATtiny841
attinyx41opti.menu.chip.841.build.mcu=attiny841
attinyx41opti.menu.chip.841.upload.maximum_size=7552
attinyx41opti.menu.chip.841.upload.maximum_data_size=512
attinyx41opti.menu.chip.441=ATtiny441
attinyx41opti.menu.chip.441.build.mcu=attiny441
attinyx41opti.menu.chip.441.upload.maximum_size=3456
attinyx41opti.menu.chip.441.upload.maximum_data_size=256
attinyx41opti.build.core=tinymodern
attinyx41opti.build.speedfix=
attinyx41opti.build.board=AVR_ATTINYX41
attinyx41opti.build.export_merged_output=false
attinyx41opti.bootloader.int5v=
attinyx41opti.bootloader.file=optiboot/optiboot_{build.mcu}_{bootloader.f_cpu}{bootloader.postfix}{bootloader.int5v}.hex
attinyx41opti.bootloader.f_cpu={build.f_cpu}
attinyx41opti.bootloader.extended_fuses=0xFE
attinyx41opti.bootloader.high_fuses=0xD7
attinyx41opti.menu.LTO.enable=Enabled
attinyx41opti.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attinyx41opti.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx41opti.menu.LTO.enable.ltocppflags=-flto
attinyx41opti.menu.LTO.enable.ltoarcmd=gcc-
attinyx41opti.menu.LTO.disable=Disabled
attinyx41opti.menu.LTO.disable.ltocflags=
attinyx41opti.menu.LTO.disable.ltoelfflags=
attinyx41opti.menu.LTO.disable.ltocppflags=
attinyx41opti.menu.LTO.disable.ltoarcmd=
attinyx41opti.menu.clock.8internal5v=8 MHz (internal, Vcc > 4.5V)
attinyx41opti.menu.clock.8internal5v.bootloader.low_fuses=0xE2
attinyx41opti.menu.clock.8internal5v.build.f_cpu=8000000L
attinyx41opti.menu.clock.8internal5v.build.clocksource=0
attinyx41opti.menu.clock.8internal5v.build.speedfix=-DLOWERCAL=6
attinyx41opti.menu.clock.8internal5v.bootloader.int5v=_int
attinyx41opti.menu.clock.8internal5v.upload.speed=57600
attinyx41opti.menu.clock.8internal=8 MHz (internal, Vcc < 4.5V)
attinyx41opti.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx41opti.menu.clock.8internal.build.f_cpu=8000000L
attinyx41opti.menu.clock.8internal.bootloader.int5v=_int
attinyx41opti.menu.clock.8internal.upload.speed=57600
attinyx41opti.menu.clock.8internal.build.clocksource=0
attinyx41opti.menu.clock.16internal=16 MHz (internal, warning - see docs!)
attinyx41opti.menu.clock.16internal.bootloader.low_fuses=0xE2
attinyx41opti.menu.clock.16internal.build.f_cpu=16000000L
attinyx41opti.menu.clock.16internal.bootloader.f_cpu=8000000L
attinyx41opti.menu.clock.16internal.build.clocksource=0
attinyx41opti.menu.clock.16internal.upload.speed=57600
attinyx41opti.menu.clock.16internal.bootloader.int5v=_int
attinyx41opti.menu.clock.16external=16 MHz (external)
attinyx41opti.menu.clock.16external.bootloader.low_fuses=0xEE
attinyx41opti.menu.clock.16external.build.f_cpu=16000000L
attinyx41opti.menu.clock.16external.build.clocksource=1
attinyx41opti.menu.clock.16external.upload.speed=115200
attinyx41opti.menu.clock.12external=12 MHz (external)
attinyx41opti.menu.clock.12external.bootloader.low_fuses=0xEE
attinyx41opti.menu.clock.12external.build.f_cpu=12000000L
attinyx41opti.menu.clock.12external.build.clocksource=1
attinyx41opti.menu.clock.12external.upload.speed=115200
attinyx41opti.menu.clock.8external=8 MHz (external)
attinyx41opti.menu.clock.8external.bootloader.low_fuses=0xED
attinyx41opti.menu.clock.8external.build.f_cpu=8000000L
attinyx41opti.menu.clock.8external.build.clocksource=1
attinyx41opti.menu.clock.8external.upload.speed=57600
attinyx41opti.menu.clock.737external=7.3728 MHz (external)
attinyx41opti.menu.clock.737external.bootloader.low_fuses=0xED
attinyx41opti.menu.clock.737external.build.f_cpu=7372800L
attinyx41opti.menu.clock.737external.build.clocksource=1
attinyx41opti.menu.clock.737external.upload.speed=57600
attinyx41opti.menu.clock.921external=9.216 MHz (external)
attinyx41opti.menu.clock.921external.bootloader.low_fuses=0xEE
attinyx41opti.menu.clock.921external.build.f_cpu=9216000L
attinyx41opti.menu.clock.921external.build.clocksource=1
attinyx41opti.menu.clock.921external.upload.speed=57600
attinyx41opti.menu.clock.110external=11.0592 MHz (external)
attinyx41opti.menu.clock.110external.bootloader.low_fuses=0xEE
attinyx41opti.menu.clock.110external.build.f_cpu=11059200L
attinyx41opti.menu.clock.110external.build.clocksource=1
attinyx41opti.menu.clock.110external.upload.speed=115200
attinyx41opti.menu.clock.147external=14.7456 MHz (external)
attinyx41opti.menu.clock.147external.bootloader.low_fuses=0xEE
attinyx41opti.menu.clock.147external.build.f_cpu=14745600L
attinyx41opti.menu.clock.147external.build.clocksource=1
attinyx41opti.menu.clock.147external.upload.speed=115200
attinyx41opti.menu.clock.184external=18.432 MHz (external - overclocked)
attinyx41opti.menu.clock.184external.bootloader.low_fuses=0xEE
attinyx41opti.menu.clock.184external.build.f_cpu=18432000L
attinyx41opti.menu.clock.184external.build.clocksource=1
attinyx41opti.menu.clock.184external.upload.speed=115200
attinyx41opti.menu.clock.20external=20 MHz (external - overclocked)
attinyx41opti.menu.clock.20external.bootloader.low_fuses=0xEE
attinyx41opti.menu.clock.20external.build.f_cpu=20000000L
attinyx41opti.menu.clock.20external.upload.speed=115200
attinyx41opti.menu.clock.20external.build.clocksource=1
attinyx41opti.menu.clock.1internal5v=1 MHz (internal, Vcc > 4.5V)
attinyx41opti.menu.clock.1internal5v.bootloader.low_fuses=0x62
attinyx41opti.menu.clock.1internal5v.build.f_cpu=1000000L
attinyx41opti.menu.clock.1internal5v.build.clocksource=0
attinyx41opti.menu.clock.1internal5v.build.speedfix=-DLOWERCAL=6
attinyx41opti.menu.clock.1internal5v.bootloader.int5v=_int
attinyx41opti.menu.clock.1internal5v.upload.speed=4800
attinyx41opti.menu.clock.1internal=1 MHz (internal, Vcc < 4.5V)
attinyx41opti.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx41opti.menu.clock.1internal.build.f_cpu=1000000L
attinyx41opti.menu.clock.1internal.bootloader.int5v=_int
attinyx41opti.menu.clock.1internal.upload.speed=4800
attinyx41opti.menu.clock.1internal.build.clocksource=0
attinyx41opti.bootloader.high_fuses=0b11011{bootloader.bod_bits}
attinyx41opti.bootloader.extended_fuses=0b111{bootloader.bodpd_bits}{bootloader.bodact_bits}0
attinyx41opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx41opti.menu.bod.1v8.bootloader.bod_bits=110
attinyx41opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx41opti.menu.bod.2v7.bootloader.bod_bits=101
attinyx41opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx41opti.menu.bod.4v3.bootloader.bod_bits=100
attinyx41opti.menu.bodact.disabled=B.O.D. Disabled (saves power)
attinyx41opti.menu.bodact.disabled.bootloader.bodact_bits=11
attinyx41opti.menu.bodact.enabled=B.O.D. Enabled
attinyx41opti.menu.bodact.enabled.bootloader.bodact_bits=10
attinyx41opti.menu.bodact.sampled=B.O.D. Sampled Mode
attinyx41opti.menu.bodact.sampled.bootloader.bodact_bits=01
attinyx41opti.menu.bodpd.disabled=B.O.D. Disabled (saves power)
attinyx41opti.menu.bodpd.disabled.bootloader.bodpd_bits=11
attinyx41opti.menu.bodpd.enabled=B.O.D. Enabled
attinyx41opti.menu.bodpd.enabled.bootloader.bodpd_bits=10
attinyx41opti.menu.bodpd.sampled=B.O.D. Sampled Mode
attinyx41opti.menu.bodpd.sampled.bootloader.bodpd_bits=01
attinyx41opti.menu.pinmapping.anew=Clockwise (like Rev. D/E boards)
attinyx41opti.menu.pinmapping.anew.build.pinmap=-DNEW_PINOUT
attinyx41opti.menu.pinmapping.old=Counterclockwise (like old ATTinyCore and Rev. C boards)
attinyx41opti.menu.pinmapping.old.build.pinmap=-DOLD_PINOUT
attinyx41opti.menu.wiremode.amaster=Master Only
attinyx41opti.menu.wiremode.amaster.build.wiremode=-DWIRE_MASTER_ONLY
attinyx41opti.menu.wiremode.slave=Slave Only
attinyx41opti.menu.wiremode.slave.build.wiremode=-DWIRE_SLAVE_ONLY
attinyx41opti.menu.wiremode.both=Both (uses more flash)
attinyx41opti.menu.wiremode.both.build.wiremode=-DWIRE_BOTH
attinyx41opti.menu.millis.enabled=Enabled
attinyx41opti.menu.millis.disabled=Disabled (saves flash)
attinyx41opti.menu.millis.enabled.build.millis=
attinyx41opti.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx41opti.menu.neopixelport.porta=Port A (CW:0~7,CCW:3~10)
attinyx41opti.menu.neopixelport.portb=Port B (CW:8~11,CCW:0~2,11)
attinyx41opti.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=PORTA
attinyx41opti.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=PORTB
attinyx41opti.build.extra_flags={build.millis} {build.neopixelport} {build.pinmap} {build.wiremode} {build.speedfix}


