SpenceKonde/ATTinyCore/avr/boards.txt
attiny1634opti.name=ATtiny1634 (Optiboot)
attiny1634opti.upload.maximum_size=15744
attiny1634opti.upload.maximum_data_size=1024
attiny1634opti.upload.protocol=arduino
attiny1634opti.upload.tool=avrdude
attiny1634opti.bootloader.tool=avrdude
attiny1634opti.bootloader.unlock_bits=0xFF
attiny1634opti.bootloader.lock_bits=0xFF
attiny1634opti.menu.bootUART.UART0=UART0 (Serial)
attiny1634opti.menu.bootUART.UART0.bootloader.postfix=
attiny1634opti.menu.bootUART.UART1=UART1 (Serial1)
attiny1634opti.menu.bootUART.UART1.bootloader.postfix=_ser1
attiny1634opti.build.mcu=attiny1634
attiny1634opti.build.core=tinymodern
attiny1634opti.build.board=AVR_ATTINY1634
attiny1634opti.build.export_merged_output=false
attiny1634opti.build.speedfix=
attiny1634opti.bootloader.extended_fuses=0xFE
attiny1634opti.bootloader.int5v=
attiny1634opti.bootloader.high_fuses=0xD7
attiny1634opti.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}{bootloader.postfix}{bootloader.int5v}.hex
attiny1634opti.menu.LTO.enable=Enabled
attiny1634opti.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attiny1634opti.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attiny1634opti.menu.LTO.enable.ltocppflags=-flto
attiny1634opti.menu.LTO.enable.ltoarcmd=gcc-
attiny1634opti.menu.LTO.disable=Disabled
attiny1634opti.menu.LTO.disable.ltocflags=
attiny1634opti.menu.LTO.disable.ltoelfflags=
attiny1634opti.menu.LTO.disable.ltocppflags=
attiny1634opti.menu.LTO.disable.ltoarcmd=
attiny1634opti.menu.clock.8internal5v=8 MHz (internal, Vcc > 4.5V )
attiny1634opti.menu.clock.8internal5v.bootloader.low_fuses=0xE2
attiny1634opti.menu.clock.8internal5v.bootloader.int5v=_int
attiny1634opti.menu.clock.8internal5v.build.speedfix=-DLOWERCAL=9
attiny1634opti.menu.clock.8internal5v.build.f_cpu=8000000L
attiny1634opti.menu.clock.8internal5v.build.clocksource=0
attiny1634opti.menu.clock.8internal5v.upload.speed=57600
attiny1634opti.menu.clock.8internal=8 MHz (internal, Vcc < 4.5V )
attiny1634opti.menu.clock.8internal.bootloader.low_fuses=0xE2
attiny1634opti.menu.clock.8internal.bootloader.int5v=_int
attiny1634opti.menu.clock.8internal.build.f_cpu=8000000L
attiny1634opti.menu.clock.8internal.build.clocksource=0
attiny1634opti.menu.clock.8internal.upload.speed=57600
attiny1634opti.menu.clock.12external=12 MHz (external)
attiny1634opti.menu.clock.12external.bootloader.low_fuses=0xEF
attiny1634opti.menu.clock.12external.build.f_cpu=12000000L
attiny1634opti.menu.clock.12external.upload.speed=115200
attiny1634opti.menu.clock.12external.build.clocksource=1
attiny1634opti.menu.clock.8external=8 MHz (external)
attiny1634opti.menu.clock.8external.bootloader.low_fuses=0xED
attiny1634opti.menu.clock.8external.build.f_cpu=8000000L
attiny1634opti.menu.clock.8external.build.clocksource=1
attiny1634opti.menu.clock.8external.upload.speed=57600
attiny1634opti.menu.clock.737external=7.3728 MHz (external)
attiny1634opti.menu.clock.737external.bootloader.low_fuses=0xED
attiny1634opti.menu.clock.737external.build.f_cpu=7372800L
attiny1634opti.menu.clock.737external.build.clocksource=1
attiny1634opti.menu.clock.737external.upload.speed=57600
attiny1634opti.menu.clock.921external=9.216 MHz (external)
attiny1634opti.menu.clock.921external.bootloader.low_fuses=0xEF
attiny1634opti.menu.clock.921external.build.f_cpu=9216000L
attiny1634opti.menu.clock.921external.build.clocksource=1
attiny1634opti.menu.clock.921external.upload.speed=57600
attiny1634opti.menu.clock.110external=11.059 MHz (external)
attiny1634opti.menu.clock.110external.bootloader.low_fuses=0xEF
attiny1634opti.menu.clock.110external.build.f_cpu=11059200L
attiny1634opti.menu.clock.110external.build.clocksource=1
attiny1634opti.menu.clock.110external.upload.speed=115200
attiny1634opti.menu.clock.147external=14.7456 MHz (external - overclocked)
attiny1634opti.menu.clock.147external.bootloader.low_fuses=0xEF
attiny1634opti.menu.clock.147external.build.f_cpu=14745600L
attiny1634opti.menu.clock.147external.build.clocksource=1
attiny1634opti.menu.clock.147external.upload.speed=115200
attiny1634opti.menu.clock.16external=16 MHz (external - overclocked)
attiny1634opti.menu.clock.16external.bootloader.low_fuses=0xEF
attiny1634opti.menu.clock.16external.build.f_cpu=16000000L
attiny1634opti.menu.clock.16external.build.clocksource=1
attiny1634opti.menu.clock.16external.upload.speed=115200
attiny1634opti.menu.clock.1internal5v=1 MHz (internal, Vcc > 4.5V )
attiny1634opti.menu.clock.1internal5v.bootloader.low_fuses=0xE2
attiny1634opti.menu.clock.1internal5v.bootloader.int5v=_int
attiny1634opti.menu.clock.1internal5v.build.speedfix=-DLOWERCAL=9
attiny1634opti.menu.clock.1internal5v.build.f_cpu=1000000L
attiny1634opti.menu.clock.1internal5v.build.clocksource=0
attiny1634opti.menu.clock.1internal5v.upload.speed=4800
attiny1634opti.menu.clock.1internal=1 MHz (internal, Vcc < 4.5V )
attiny1634opti.menu.clock.1internal.bootloader.low_fuses=0xE2
attiny1634opti.menu.clock.1internal.bootloader.int5v=_int
attiny1634opti.menu.clock.1internal.build.f_cpu=1000000L
attiny1634opti.menu.clock.1internal.build.clocksource=0
attiny1634opti.menu.clock.1internal.upload.speed=4800
attiny1634opti.bootloader.high_fuses=0b11011{bootloader.bod_bits}
attiny1634opti.bootloader.extended_fuses=0b111{bootloader.bodpd_bits}{bootloader.bodact_bits}0
attiny1634opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny1634opti.menu.bod.1v8.bootloader.bod_bits=110
attiny1634opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny1634opti.menu.bod.2v7.bootloader.bod_bits=101
attiny1634opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny1634opti.menu.bod.4v3.bootloader.bod_bits=100
attiny1634opti.menu.bodact.disabled=B.O.D. Disabled (saves power)
attiny1634opti.menu.bodact.disabled.bootloader.bodact_bits=11
attiny1634opti.menu.bodact.enabled=B.O.D. Enabled
attiny1634opti.menu.bodact.enabled.bootloader.bodact_bits=10
attiny1634opti.menu.bodact.sampled=B.O.D. Sampled Mode
attiny1634opti.menu.bodact.sampled.bootloader.bodact_bits=01
attiny1634opti.menu.bodpd.disabled=B.O.D. Disabled (saves power)
attiny1634opti.menu.bodpd.disabled.bootloader.bodpd_bits=11
attiny1634opti.menu.bodpd.enabled=B.O.D. Enabled
attiny1634opti.menu.bodpd.enabled.bootloader.bodpd_bits=10
attiny1634opti.menu.bodpd.sampled=B.O.D. Sampled Mode
attiny1634opti.menu.bodpd.sampled.bootloader.bodpd_bits=01
attiny1634opti.menu.millis.enabled=Enabled
attiny1634opti.menu.millis.disabled=Disabled (saves flash)
attiny1634opti.menu.millis.enabled.build.millis=
attiny1634opti.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attiny1634opti.menu.neopixelport.porta=Port A (pins 1~8)
attiny1634opti.menu.neopixelport.portb=Port B (pins 0,14,15,16)
attiny1634opti.menu.neopixelport.portc=Port C (pins 9~13, 17)
attiny1634opti.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=PORTA
attiny1634opti.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=PORTB
attiny1634opti.menu.neopixelport.portc.build.neopixelport=-DNEOPIXELPORT=PORTC
attiny1634opti.build.extra_flags={build.millis} {build.neopixelport} {build.speedfix}


attinyx313.name=ATtiny2313(a)/4313 (No bootloader)
attinyx313.upload.maximum_size=4096
attinyx313.upload.maximum_data_size=256
attinyx313.upload.tool=avrdude
attinyx313.bootloader.tool=avrdude
attinyx313.bootloader.unlock_bits=0xFF
attinyx313.bootloader.lock_bits=0xFF
attinyx313.bootloader.file=empty/empty_all.hex
attinyx313.build.core=tiny
attinyx313.build.board=AVR_ATTINYX313
attinyx313.build.export_merged_output=false
attinyx313.bootloader.extended_fuses=0xFF
attinyx313.menu.LTO.enable=Enabled
attinyx313.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attinyx313.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx313.menu.LTO.enable.ltocppflags=-flto
attinyx313.menu.LTO.enable.ltoarcmd=gcc-
attinyx313.menu.LTO.disable=Disabled
attinyx313.menu.LTO.disable.ltocflags=
attinyx313.menu.LTO.disable.ltoelfflags=
attinyx313.menu.LTO.disable.ltocppflags=
attinyx313.menu.LTO.disable.ltoarcmd=
attinyx313.menu.chip.4313=ATtiny4313
attinyx313.menu.chip.4313.build.mcu=attiny4313
attinyx313.menu.chip.4313.upload.maximum_size=4096
attinyx313.menu.chip.4313.upload.maximum_data_size=256
attinyx313.menu.chip.2313=ATtiny2313/ATtiny2313A
attinyx313.menu.chip.2313.build.mcu=attiny2313a
attinyx313.menu.chip.2313.upload.maximum_size=2048
attinyx313.menu.chip.2313.upload.maximum_data_size=128
attinyx313.menu.clock.8internal=8 MHz (internal)
attinyx313.menu.clock.8internal.bootloader.low_fuses=0xE4
attinyx313.menu.clock.8internal.build.f_cpu=8000000L
attinyx313.menu.clock.8internal.build.clocksource=0
attinyx313.menu.clock.20external=20 MHz (external)
attinyx313.menu.clock.20external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.20external.build.f_cpu=20000000L
attinyx313.menu.clock.20external.build.clocksource=1
attinyx313.menu.clock.16external=16 MHz (external)
attinyx313.menu.clock.16external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.16external.build.f_cpu=16000000L
attinyx313.menu.clock.16external.build.clocksource=1
attinyx313.menu.clock.12external=12 MHz (external)
attinyx313.menu.clock.12external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.12external.build.f_cpu=12000000L
attinyx313.menu.clock.12external.build.clocksource=1
attinyx313.menu.clock.8external=8 MHz (external)
attinyx313.menu.clock.8external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.8external.build.f_cpu=8000000L
attinyx313.menu.clock.8external.build.clocksource=1
attinyx313.menu.clock.1internal=1 MHz (internal)
attinyx313.menu.clock.1internal.bootloader.low_fuses=0x64
attinyx313.menu.clock.1internal.build.f_cpu=1000000L
attinyx313.menu.clock.1internal.build.clocksource=0
attinyx313.menu.clock.4internal=4 MHz (internal)
attinyx313.menu.clock.4internal.bootloader.low_fuses=0xE2
attinyx313.menu.clock.4internal.build.f_cpu=4000000L
attinyx313.menu.clock.4internal.build.clocksource=5
attinyx313.menu.clock.6external=6 MHz (external)
attinyx313.menu.clock.6external.bootloader.low_fuses=0xFD
attinyx313.menu.clock.6external.build.f_cpu=6000000L
attinyx313.menu.clock.6external.build.clocksource=1
attinyx313.menu.clock.4external=4 MHz (external)
attinyx313.menu.clock.4external.bootloader.low_fuses=0xFD
attinyx313.menu.clock.4external.build.f_cpu=4000000L
attinyx313.menu.clock.4external.build.clocksource=1
attinyx313.menu.clock.5internal=0.5 MHz (internal)
attinyx313.menu.clock.5internal.bootloader.low_fuses=0x62
attinyx313.menu.clock.5internal.build.f_cpu=500000L
attinyx313.menu.clock.5internal.build.clocksource=5
attinyx313.menu.clock.737external=7.372 MHz (external)
attinyx313.menu.clock.737external.bootloader.low_fuses=0xFD
attinyx313.menu.clock.737external.build.f_cpu=7372800L
attinyx313.menu.clock.737external.build.clocksource=1
attinyx313.menu.clock.92external=9.216 MHz (external)
attinyx313.menu.clock.92external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.92external.build.f_cpu=9216000L
attinyx313.menu.clock.92external.build.clocksource=1
attinyx313.menu.clock.11external=11.0592 MHz (external)
attinyx313.menu.clock.11external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.11external.build.f_cpu=11059200L
attinyx313.menu.clock.11external.build.clocksource=1
attinyx313.menu.clock.14external=14.7456 MHz (external)
attinyx313.menu.clock.14external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.14external.build.f_cpu=14745600L
attinyx313.menu.clock.14external.build.clocksource=1
attinyx313.menu.clock.184external=18.432 MHz (external)
attinyx313.menu.clock.184external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.184external.build.f_cpu=18432000L
attinyx313.menu.clock.184external.build.clocksource=1
attinyx313.menu.clock.128internal=128 kHz (internal WDT)
attinyx313.menu.clock.128internal.bootloader.low_fuses=0xC5
attinyx313.menu.clock.128internal.build.f_cpu=128000L
attinyx313.menu.clock.128internal.build.clocksource=3
attinyx313.bootloader.high_fuses=0b{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx313.menu.eesave.aenable=EEPROM retained
attinyx313.menu.eesave.aenable.bootloader.eesave_bit=1001
attinyx313.menu.eesave.disable=EEPROM not retained
attinyx313.menu.eesave.disable.bootloader.eesave_bit=1101
attinyx313.menu.bod.disable=B.O.D. Disabled (saves power)
attinyx313.menu.bod.disable.bootloader.bod_bits=1111
attinyx313.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx313.menu.bod.1v8.bootloader.bod_bits=1101
attinyx313.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx313.menu.bod.2v7.bootloader.bod_bits=1011
attinyx313.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx313.menu.bod.4v3.bootloader.bod_bits=1001
attinyx313.menu.INITIALIZE_SECONDARY_TIMERS.0=no
attinyx313.menu.INITIALIZE_SECONDARY_TIMERS.1=yes
attinyx313.menu.INITIALIZE_SECONDARY_TIMERS.0.build.initsectimer=
attinyx313.menu.INITIALIZE_SECONDARY_TIMERS.1.build.initsectimer=-DINITIALIZE_SECONDARY_TIMERS=1
attinyx313.build.variant=tinyX313
attinyx313.menu.millis.enabled=Enabled
attinyx313.menu.millis.disabled=Disabled (saves flash)
attinyx313.menu.millis.enabled.build.millis=
attinyx313.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx313.menu.neopixelport.porta=Port A (pins 2,3,17)
attinyx313.menu.neopixelport.portb=Port B (pins 0,1,4~8)
attinyx313.menu.neopixelport.portd=Port D (pins 9~16)
attinyx313.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=PORTA
attinyx313.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=PORTB
attinyx313.menu.neopixelport.portd.build.neopixelport=-DNEOPIXELPORT=PORTD
attinyx313.build.extra_flags={build.millis} {build.neopixelport} {build.initsectimer}
